[
  {
    "id": 1,
    "avatar": "assets/riwnlmk.png",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "07 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "অনেকেই বলে, বইয়ের কভার দেখে বইকে বিচার করা উচিত নয়। কিন্তু আমার ক্ষেত্রে বিষয়টি একটু ভিন্ন। আমি প্রথম মুহূর্তেই বইয়ের প্রতি আকৃষ্ট হই কভারের মাধ্যমে। গা ছমছমে কলকাতা পড়ার জন্য আমি আগ্রহী হয়েছি ঠিক সেই আকর্ষণ থেকেই। বইটি হাতে পেতে কিছুটা সময় লেগেছিলো, কারণ এটি ভারতের থেকে সংগ্রহ করতে হয়েছিলো। বাংলাদেশে পাওয়া গেলেও দাম একটু বেশিই ছিলো, তবুও প্রতীক্ষার মূল্য রাখার মতো বই এটি। বইটি কলকাতার পুরনো অলিগলির রহস্য আর অতিলৌকিক ঘটনাবলি নিয়ে ভরা। প্রতিটি পাতায় গা ছমছমে ভয় অনুভূতি জাগে, যেন ধ্রুমি ধ্রুমি করে শিহরণ বয়ে চলে। ধুয়ে যাওয়া জ্যোৎস্নার রাতে অন্ধকার ও আলো-আঁধারির খেলায় পুরো পরিবেশ যেন জীবন্ত হয়ে ওঠে।\n\nমাঝরাতের কলকাতার ন্যাশনেল লাইব্রেরি, হেস্টিংস হাউজ, হাইকোর্ট, খিদিরপুর ডক, রেসকোর্স, গোরস্থান এবং ভুতুড়ে মেট্রো স্টেশন এই সব স্থান আচমকাই এক অচেনা, অপার্থিব জগতে রূপান্তরিত হয়। কোথাও পিয়ানো বাজতে থাকে, কোথাও লিফট নিজে নিজে ওঠানামা করে। কারো হাহাকার শুনতে পাওয়া যায়, আবার কোথাও আচমকাই হাসি ফোটে। প্রতিটি পাতা নিঃশব্দ শিহরণ ফেলে পাঠকের মনে।"
      }
    ]
  },
  {
    "id": 2,
    "avatar": "assets/riwnlmk.png",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "08 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "একজন শুভাকাঙ্খীর সাজেশনের ভিত্তিতে রিভিউ অপশন যুক্ত করা হয়েছে। আজ থেকে প্রতিটি বই পড়ার পরে অথবা প্রতিটা অ্যানিমে দেখার পর আমি চেষ্টা করবো ছোট একটি রিভিউ লেখার। পাশাপাশি, এই প্ল্যাটফর্মটিকে আরও ব্যবহারবান্ধব করার জন্য বিভিন্ন সোশ্যাল মিডিয়ার আইকনও সংযুক্ত করা হয়েছে। এই আপডেটের মাধ্যমে এখন আরও স্বচ্ছন্দ এবং আকর্ষণীয় হয়ে উঠেছে।"
      }
    ]
  },
  {
    "id": 3,
    "avatar": "assets/riwnlmk.png",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "10 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "বই পড়া এবং অ্যানিমে দেখা আমার সবচেয়ে প্রিয় কাজের মধ্যে একটি। তবে আমি একজন প্রযুক্তি প্রেমী মানুষ। যেহেতু আমি প্রযুক্তির প্রতি আগ্রহী, একসময় প্রযুক্তি বিষয়ক ব্লগ লেখালেখি করতাম। তাই পরিকল্পনা করলাম, এখন আমার শেলফের টাইমলাইনেও প্রযুক্তি বিষয়ক লেখালেখি চালিয়ে যাবো। অনেকসময় কোডের স্নিপেট শেয়ার করার প্রয়োজন হয়। আগে এর জন্য কোনো সুবিধাজনক পদ্ধতি ছিলো না। তাই আমি কোড শেয়ারিং ব্লক তৈরি করলাম, এতে করে যেকোনো কমান্ড ইত্যাদি শেয়ারের পাশাপাশি খুব সহজেই সেটা কপিও করা সম্ভব হবে এখন থেকে।\n\nউদাহরণস্বরূপঃ"
      },
      {
        "type": "code",
        "lang": "python",
        "code": "print(\"Hello World\")"
      },
      {
        "type": "text",
        "content": "আমি পাইথন ভাষায় প্রোগ্রাম লিখতে পছন্দ করি, তাই শুভেচ্ছা বার্তাও পাইথনে লিখলাম। আশা করি, ফ্রি সময়ে প্রযুক্তি বিষয়ক লেখালেখি আবার শুরু করতে পারবো। পাশাপাশি, অন্য ট্যাব গুলোর মতো টাইমলাইনেও সার্চ ফিচার ইমপ্লিমেন্ট করলাম। এর ফলে টাইমলাইনের পোস্টগুলো এখন খুব সহজেই খুঁজে পাওয়া যাবে।"
      }
    ]
  },
  {
    "id": 4,
    "avatar": "assets/riwnlmk.png",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "21 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "টাইমলাইন এমন একটি স্থান যেখানে সময়ের সঙ্গে সঙ্গে বিভিন্ন লেখা যেন গভীরে তলিয়ে যায়। তাই আমি পোস্ট শেয়ার পদ্ধতি তৈরি করলাম, যার মাধ্যমে খুব সহজেই যেকোনো পোস্টের সরাসরি লিঙ্ক ব্যবহার করে তা খুঁজে পাওয়া যাবে। একই সঙ্গে আজ থেকে নতুন কিছু বই পড়ার পরিকল্পনা করেছি। তালিকায় রয়েছে সায়ক আমানের কুয়াশার ফুল, ইমরান হোসাইনের আদিবের কাঠগোলাপ এবং ডেল কার্নেগীর দুশ্চিন্তাহীন নতুন জীবন। আশা করছি, খুব শীঘ্রই এই তিনটি বই আমার শেলফে যুক্ত হবে।"
      }
    ]
  },
  {
    "id": 5,
    "avatar": "assets/riwnlmk.png",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "24 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "লিনাক্স ব্যবহারকারীদের জন্য প্রতিদিনের একটি বড় কাজ হলো সিস্টেম আপডেট রাখা। বিশেষ করে আর্চ লিনাক্সের মতো রোলিং রিলিজ সিস্টেমে নিয়মিত আপডেট না করলে বিভিন্ন সফটওয়্যার প্যাকেজের সামঞ্জস্য সমস্যা তৈরি হতে পারে। আবার সঠিক মিরর ব্যবহার না করলে আপডেট প্রক্রিয়া ধীরগতি হতে পারে কিংবা মাঝপথে থেমে যেতে পারে। এই সবকিছু একসাথে ম্যানেজ করা সাধারণ ব্যবহারকারীর কাছে সময় সাপেক্ষ এবং জটিল মনে হতে পারে। তাই আমি ভাবছিলাম যদি এমন একটি স্ক্রিপ্ট থাকে, যা একসাথে মিরর আপডেট, সিস্টেম আপগ্রেড এবং আপগ্রেড শেষে নোটিফিকেশন সরাসরি টেলিগ্রামের পছন্দমতো গ্রুপ অথবা চ্যানেলে পাঠিয়ে দেয়, তবে কাজটি অনেক সহজ হয়ে যায়।\nএই জন্যই আমি ম্যানপ্যাক নামের একটা শেল স্ক্রিপ্ট লিখি, এই স্ক্রিপ্টের সবচেয়ে বড় সুবিধা হলো স্বয়ংক্রিয়তা। একবার স্ক্রিপ্ট চালালেই প্রথমে আর্চ লিনাক্সের অফিসিয়াল ওয়েবসাইট থেকে সর্বশেষ মিররলিস্ট ডাউনলোড হয়ে যায় এবং সেটি সিস্টেমে প্রয়োগ হয়। এতে ব্যবহারকারী নিশ্চিত থাকেন যে তিনি সর্বদা আপডেটেড ও সক্রিয় মিরর ব্যবহার করছেন। দ্রুত ও নির্ভরযোগ্য মিরর ব্যবহার করার ফলে প্যাকেজ ডাউনলোড গতি বেড়ে যায় এবং আপডেট প্রক্রিয়াও অনেকটাই মসৃণ হয়ে ওঠে। ফলে বারবার নিজে থেকে মিররলিস্ট ম্যানুয়ালি সম্পাদনা করার ঝামেলা আর থাকে না।\n\nপরবর্তী ধাপে স্ক্রিপ্ট স্বয়ংক্রিয়ভাবে সিস্টেম আপগ্রেড করে। সাধারণত ব্যবহারকারীকে আলাদা করে প্যাকম্যান এসএসওয়াইইউ চালাতে হয়, কিন্তু এখানে স্ক্রিপ্ট নিজেই সেটি করে দেয়। এর ফলে ব্যবহারকারী নিশ্চিত থাকতে পারেন যে তার সিস্টেম সর্বদা হালনাগাদ এবং নিরাপত্তাজনিত ঝুঁকি থেকে মুক্ত। নিয়মিত সিস্টেম আপডেট করা শুধু নতুন ফিচার পাওয়ার জন্য নয়, বরং নিরাপত্তা দুর্বলতা বা বাগ দ্রুত সমাধান করার জন্যও অত্যন্ত গুরুত্বপূর্ণ। এই স্ক্রিপ্ট সেই কাজটি খুব সহজভাবে সম্পন্ন করে দেয়।\nসবচেয়ে আকর্ষণীয় অংশ হলো নোটিফিকেশন সিস্টেম। আপডেট শেষ হওয়ার পর স্ক্রিপ্ট একটি সুন্দরভাবে সাজানো বার্তা টেলিগ্রামে পাঠায়, যেখানে সিস্টেম সম্পর্কিত মৌলিক তথ্য যেমন ডিস্ট্রিবিউশনের নাম, কার্নেল ভার্সন, হোস্টনেম, ব্যবহারকারীর নাম, তারিখ ও সময় উল্লেখ থাকে। এর সাথে আপডেট সফল হয়েছে কিনা তাও বার্তায় দেখা যায়। ফলে ব্যবহারকারীকে আর টার্মিনালের সামনে বসে থাকতে হয় না, বরং মোবাইলেই আপডেটের খবর পেয়ে যান। এটি বিশেষ করে সার্ভার অ্যাডমিনিস্ট্রেটরদের জন্য অনেক উপকারী, কারণ তারা দূরে থেকেও সহজেই জানতে পারেন যে সার্ভার ঠিকভাবে আপডেট হয়েছে।\n\nযারা আর্চ লিনাক্স ব্যবহার করেন তাদের জন্য আমি ম্যানপ্যাক স্ক্রিপ্ট নিচে শেয়ার করছি। এটি একদম হাতে কলমে সহায়ক সমাধান হবে ইন শা আল্লাহ।"
      },
      {
        "type": "code",
        "lang": "shell",
        "code": "#!/bin/bash\n# Author: Md. Ridwanul Islam Muntakim\n# Email Address: riwnlmk@gmail.com\n\nsend_message() {\n    # Define your Telegram bot's token here\n    BOT_TOKEN=\"YOUR_BOT_TOKEN_HERE\"\n    # Define the chat ID where the message will be sent\n    CHAT_ID=\"YOUR_CHAT_ID_HERE\"\n    \n    # Get the distribution name (e.g. Arch Linux) using lsb_release or fallback to /etc/*release\n    DISTRO=$(lsb_release -ds 2>/dev/null || cat /etc/*release | grep -E '^NAME=' | awk -F= '{print $2}' | tr -d '\"')\n    # Get the kernel version using the uname command\n    KERNEL=$(uname -r)\n    # Get the system's hostname, using 'hostname' command or fallback to 'uname -n'\n    HOSTNAME=$(hostname 2>/dev/null || uname -n)\n    # Get the current user's username\n    USERNAME=$(whoami)\n    # Get the current date\n    CURRENT_DATE=$(date +\"%a %b %d, %Y\")\n    # Get the current time\n    CURRENT_TIME=$(date +\"%I:%M %p\")\n    \n    # Create a formatted message that includes the collected system information\n    MESSAGE=\"System: $DISTRO\nKernel: $KERNEL\nHostname: $HOSTNAME\nUsername: $USERNAME\nDate: $CURRENT_DATE\nTime: $CURRENT_TIME\nUpgrade Status: Success\"\n    \n    # Use curl to send the message to Telegram, suppressing the terminal output\n    curl -s -X POST \"https://api.telegram.org/bot$BOT_TOKEN/sendMessage\" \\\n         -d \"chat_id=$CHAT_ID\" \\\n         -d \"text=$MESSAGE\" > /dev/null 2>&1\n}\n\n# The following command fetches the latest mirrorlist from the Arch Linux website\ncurl -s \"https://archlinux.org/mirrorlist/?country=all&protocol=http&protocol=https&ip_version=4&use_mirror_status=on\" | \\\n    # The 'sed' command is used to uncomment the lines starting with '#Server' to activate the server list\n    sed '0,/^#Server/ s/^#//' |\n    # The 'tee' command writes the modified mirrorlist to the /etc/pacman.d/mirrorlist file with elevated privileges\n    sudo tee /etc/pacman.d/mirrorlist > /dev/null  \n\n# Prints a success message indicating the mirror list has been updated\necho -e \"Mirrorlist updated successfully!\"\n\n# The following command synchronizes the package databases and upgrades the system packages\nsudo pacman -Syu\nsend_message"
      },
      {
        "type": "text",
        "content": "সব মিলিয়ে স্ক্রিপ্টটি আর্চ লিনাক্স ব্যবহারকারীদের জন্য একটি অত্যন্ত কার্যকরী টুল। এটি সময় বাঁচায়, আপডেট প্রক্রিয়া সহজ করে, নোটিফিকেশন সিস্টেম যোগ করে ব্যবহারকারীকে সবসময় আপডেটেড রাখে এবং মিরর ম্যানেজমেন্টের ঝামেলা থেকে মুক্তি দেয়। যারা আর্চ লিনাক্স ব্যবহার করেন তাদের জন্য এটি একদম হাতে কলমে সহায়ক সমাধান।"
      }
    ]
  }
]