[
  {
    "id": 1,
    "avatar": "assets/md._ridwanul_islam_muntakim.jpg",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "26 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "লিনাক্স শেখার সময় অনেকেই মনোলিথিক কার্নেল আর মাইক্রো কার্নেলের পার্থক্য নিয়ে বিভ্রান্ত হয়ে থাকেন। কিছু লেখায় এমন ধারণা দেওয়া হয় যে, মাইক্রো কার্নেল পুরোপুরি ইউজার স্পেসে চলে। মৌলিক লিনাক্স নামের একটা পিডিএফ বই পড়ছিলাম নতুন একজনকে সুপারিশ করার জন্য। বইটার লেখক রাজীব চৌধুরী। বইটাতে লিনাক্স কি নামক অধ্যায়ে লেখা আছে যে “মনোলিথিক কার্নেল অপারেটিং সিস্টেমের কর্মক্ষমতা বৃদ্ধির জন্য অপারেটিং সিস্টেমের সকল কোড কার্নেল এড্রেস স্পেসে সম্পাদন করে যেখানে মাইক্রো কার্নেল কোডগুলোকে ইউজার স্পেসে সম্পাদন করে”\n\nআসলে বিষয়টি ঠিক তেমন নয়। বাস্তবে মাইক্রো কার্নেলের একটি ছোট ও অত্যাবশ্যক অংশ (যেমনঃ প্রসেস সিডিউলার, মৌলিক মেমোরি ম্যানেজমেন্ট, ইন্টার-প্রসেস কমিউনিকেশন বা আইপিসি) কার্নেল স্পেসে রান করে, কারণ হার্ডওয়্যারের সঙ্গে সরাসরি যোগাযোগের জন্য এই অংশগুলোতে উচ্চ পর্যায়ের প্রিভিলেজে থাকা জরুরি। তবে ডিভাইস ড্রাইভার, ফাইল সিস্টেম, নেটওয়ার্ক স্ট্যাকের মতো অতিরিক্ত সার্ভিসগুলো আলাদা প্রক্রিয়া হিসেবে ইউজার স্পেসে রাখা হয়।\n\nএর ফলে কোনো সার্ভিসে ত্রুটি ঘটলে পুরো সিস্টেম ক্র্যাশ না করে কেবল ওই সার্ভিসটি পুনরায় চালু করা সম্ভব হয়। বিপরীতে, মনোলিথিক কার্নেলে সবকিছু একসঙ্গে কার্নেল স্পেসে থাকে, যা কর্মক্ষমতা বাড়ায় বটে, কিন্তু একটি অংশে ত্রুটি হলে পুরো সিস্টেমকে ঝুঁকির মুখে ফেলে। তাই মূল পার্থক্য হলো মনোলিথিক কার্নেল একীভূত ও কর্মক্ষমতায় উন্নত, আর মাইক্রো কার্নেল তুলনামূলক স্থিতিশীল ও নিরাপদ।"
      }
    ]
  },
  {
    "id": 2,
    "avatar": "assets/md._ridwanul_islam_muntakim.jpg",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "12 February 2026",
    "blocks": [
      {
        "type": "text",
        "content": "আজ আমি জীবনের প্রথম ভোট দিলাম। এই অভিজ্ঞতাটি আমার জন্য একটি গুরুত্বপূর্ণ মাইলফলক হয়ে থাকবে। ভোটকেন্দ্রে প্রবেশের মুহূর্তটি সত্যিই বিশেষ ছিলো। চারপাশের পরিবেশ, দায়িত্বশীল কর্মকর্তাদের উপস্থিতি এবং নিয়মতান্ত্রিক প্রক্রিয়ার মধ্য দিয়ে নিজের পালা আসার অপেক্ষা, সবকিছু মিলিয়ে এটি ছিলো সচেতন নাগরিক হিসেবে নিজেকে নতুনভাবে উপলব্ধি করার একটি সময়। এটি কেবল একটি ব্যালটে সিল দেওয়ার কাজ নয়, বরং গণতান্ত্রিক প্রক্রিয়ায় সরাসরি অংশগ্রহণের একটি দায়িত্বপূর্ণ পদক্ষেপ। ভোট দেওয়ার মাধ্যমে একজন নাগরিক তার মতামত প্রকাশ করে, দেশের নীতি নির্ধারণের প্রক্রিয়ায় অংশ নেয় এবং ভবিষ্যৎ প্রজন্মের জন্য একটি দিকনির্দেশনা নির্ধারণে ভূমিকা রাখে। এই অধিকার অর্জনের পেছনে আমাদের দেশের ইতিহাস, সংগ্রাম ও ত্যাগ জড়িয়ে আছে, তাই এর মূল্যও অনেক গভীর।"
      },
      {
        "type": "image",
        "src": "media/vote.jpg",
        "caption": "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট"
      },
      {
        "type": "text",
        "content": "আমার কাছে ভোট দেওয়া মানে শুধু ব্যক্তিগত সিদ্ধান্ত নয়, বরং সম্মিলিত ভবিষ্যতের প্রতি দায়বদ্ধতা প্রকাশ। একটি সুষ্ঠু, স্বচ্ছ ও জবাবদিহিমূলক রাষ্ট্রব্যবস্থা গড়ে তুলতে নাগরিকের সক্রিয় অংশগ্রহণ অপরিহার্য। আমরা যদি সচেতনভাবে আমাদের দায়িত্ব পালন করি, তবে গণতন্ত্র আরও শক্তিশালী হবে এবং উন্নয়নের পথ আরও সুদৃঢ় হবে। আমার বিশ্বাস, সৎ নেতৃত্ব ও সচেতন জনগণের সম্মিলিত প্রচেষ্টায়, ইন শা আল্লাহ, বাংলাদেশ আরও উন্নত ও সমৃদ্ধ দেশে পরিণত হবে। আমাদের প্রত্যেকের ছোট ছোট দায়িত্বশীল পদক্ষেপই একদিন বৃহৎ পরিবর্তনের ভিত্তি গড়ে তুলবে।"
      }
    ]
  }
]