[
  {
    "id": 1,
    "avatar": "assets/md._ridwanul_islam_muntakim.jpg",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "26 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "লিনাক্স শেখার সময় অনেকেই মনোলিথিক কার্নেল আর মাইক্রো কার্নেলের পার্থক্য নিয়ে বিভ্রান্ত হয়ে থাকেন। কিছু লেখায় এমন ধারণা দেওয়া হয় যে, মাইক্রো কার্নেল পুরোপুরি ইউজার স্পেসে চলে। মৌলিক লিনাক্স নামের একটা পিডিএফ বই পড়ছিলাম নতুন একজনকে সুপারিশ করার জন্য। বইটার লেখক রাজীব চৌধুরী। বইটাতে লিনাক্স কি নামক অধ্যায়ে লেখা আছে যে “মনোলিথিক কার্নেল অপারেটিং সিস্টেমের কর্মক্ষমতা বৃদ্ধির জন্য অপারেটিং সিস্টেমের সকল কোড কার্নেল এড্রেস স্পেসে সম্পাদন করে যেখানে মাইক্রো কার্নেল কোডগুলোকে ইউজার স্পেসে সম্পাদন করে”\n\nআসলে বিষয়টি ঠিক তেমন নয়। বাস্তবে মাইক্রো কার্নেলের একটি ছোট ও অত্যাবশ্যক অংশ (যেমনঃ প্রসেস সিডিউলার, মৌলিক মেমোরি ম্যানেজমেন্ট, ইন্টার-প্রসেস কমিউনিকেশন বা আইপিসি) কার্নেল স্পেসে রান করে, কারণ হার্ডওয়্যারের সঙ্গে সরাসরি যোগাযোগের জন্য এই অংশগুলোতে উচ্চ পর্যায়ের প্রিভিলেজে থাকা জরুরি। তবে ডিভাইস ড্রাইভার, ফাইল সিস্টেম, নেটওয়ার্ক স্ট্যাকের মতো অতিরিক্ত সার্ভিসগুলো আলাদা প্রক্রিয়া হিসেবে ইউজার স্পেসে রাখা হয়।\n\nএর ফলে কোনো সার্ভিসে ত্রুটি ঘটলে পুরো সিস্টেম ক্র্যাশ না করে কেবল ওই সার্ভিসটি পুনরায় চালু করা সম্ভব হয়। বিপরীতে, মনোলিথিক কার্নেলে সবকিছু একসঙ্গে কার্নেল স্পেসে থাকে, যা কর্মক্ষমতা বাড়ায় বটে, কিন্তু একটি অংশে ত্রুটি হলে পুরো সিস্টেমকে ঝুঁকির মুখে ফেলে। তাই মূল পার্থক্য হলো মনোলিথিক কার্নেল একীভূত ও কর্মক্ষমতায় উন্নত, আর মাইক্রো কার্নেল তুলনামূলক স্থিতিশীল ও নিরাপদ।"
      }
    ]
  },
  {
    "id": 2,
    "avatar": "assets/md._ridwanul_islam_muntakim.jpg",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "12 February 2026",
    "blocks": [
      {
        "type": "text",
        "content": "আজ আমি জীবনের প্রথম ভোট দিলাম। ভোটকেন্দ্রে প্রবেশের মুহূর্তটি আমার কাছে সত্যিই বিশেষ ছিলো। এটি কেবল একটি ব্যালটে সিল দেওয়ার কাজ নয়, বরং গণতান্ত্রিক প্রক্রিয়ায় সরাসরি অংশগ্রহণের একটি দায়িত্বপূর্ণ পদক্ষেপ। আমার বিশ্বাস সৎ নেতৃত্ব ও সচেতন জনগণের সম্মিলিত প্রচেষ্টায়, ইন শা আল্লাহ, বাংলাদেশ আরও উন্নত হবে।"
      },
      {
        "type": "image",
        "src": "media/vote.jpg",
        "caption": "ত্রয়োদশ জাতীয় সংসদ নির্বাচন ও গণভোট"
      }
    ]
  }
]