[
  {
    "id": 1,
    "avatar": "assets/riwnlmk.png",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "07 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "অনেকেই বলে, বইয়ের কভার দেখে বইকে বিচার করা উচিত নয়। কিন্তু আমার ক্ষেত্রে বিষয়টি একটু ভিন্ন। আমি প্রথম মুহূর্তেই বইয়ের প্রতি আকৃষ্ট হই কভারের মাধ্যমে। গা ছমছমে কলকাতা পড়ার জন্য আমি আগ্রহী হয়েছি ঠিক সেই আকর্ষণ থেকেই। বইটি হাতে পেতে কিছুটা সময় লেগেছিলো, কারণ এটি ভারতের থেকে সংগ্রহ করতে হয়েছিলো। বাংলাদেশে পাওয়া গেলেও দাম একটু বেশিই ছিলো, তবুও প্রতীক্ষার মূল্য রাখার মতো বই এটি। বইটি কলকাতার পুরনো অলিগলির রহস্য আর অতিলৌকিক ঘটনাবলি নিয়ে ভরা। প্রতিটি পাতায় গা ছমছমে ভয় অনুভূতি জাগে, যেন ধ্রুমি ধ্রুমি করে শিহরণ বয়ে চলে। ধুয়ে যাওয়া জ্যোৎস্নার রাতে অন্ধকার ও আলো-আঁধারির খেলায় পুরো পরিবেশ যেন জীবন্ত হয়ে ওঠে।\n\nমাঝরাতের কলকাতার ন্যাশনেল লাইব্রেরি, হেস্টিংস হাউজ, হাইকোর্ট, খিদিরপুর ডক, রেসকোর্স, গোরস্থান এবং ভুতুড়ে মেট্রো স্টেশন এই সব স্থান আচমকাই এক অচেনা, অপার্থিব জগতে রূপান্তরিত হয়। কোথাও পিয়ানো বাজতে থাকে, কোথাও লিফট নিজে নিজে ওঠানামা করে। কারো হাহাকার শুনতে পাওয়া যায়, আবার কোথাও আচমকাই হাসি ফোটে। প্রতিটি পাতা নিঃশব্দ শিহরণ ফেলে পাঠকের মনে।"
      }
    ]
  },
  {
    "id": 2,
    "avatar": "assets/riwnlmk.png",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "08 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "একজন শুভাকাঙ্খীর সাজেশনের ভিত্তিতে রিভিউ অপশন যুক্ত করা হয়েছে। আজ থেকে প্রতিটি বই পড়ার পরে অথবা প্রতিটা অ্যানিমে দেখার পর আমি চেষ্টা করবো ছোট একটি রিভিউ লেখার। পাশাপাশি, এই প্ল্যাটফর্মটিকে আরও ব্যবহারবান্ধব করার জন্য বিভিন্ন সোশ্যাল মিডিয়ার আইকনও সংযুক্ত করা হয়েছে। এই আপডেটের মাধ্যমে এখন আরও স্বচ্ছন্দ এবং আকর্ষণীয় হয়ে উঠেছে।"
      }
    ]
  },
  {
    "id": 3,
    "avatar": "assets/riwnlmk.png",
    "user": "Md. Ridwanul Islam Muntakim",
    "date": "10 September 2025",
    "blocks": [
      {
        "type": "text",
        "content": "বই পড়া এবং অ্যানিমে দেখা আমার সবচেয়ে প্রিয় কাজের মধ্যে একটি। তবে আমি একজন প্রযুক্তি প্রেমী মানুষ। যেহেতু আমি প্রযুক্তির প্রতি আগ্রহী, একসময় প্রযুক্তি বিষয়ক ব্লগ লেখালেখি করতাম। তাই পরিকল্পনা করলাম, এখন আমার শেলফের টাইমলাইনেও প্রযুক্তি বিষয়ক লেখালেখি চালিয়ে যাবো। অনেকসময় কোডের স্নিপেট শেয়ার করার প্রয়োজন হয়। আগে এর জন্য কোনো সুবিধাজনক পদ্ধতি ছিলো না। তাই আমি কোড শেয়ারিং ব্লক তৈরি করলাম, এতে করে যেকোনো কমান্ড ইত্যাদি শেয়ারের পাশাপাশি খুব সহজেই সেটা কপিও করা সম্ভব হবে এখন থেকে।\n\nউদাহরণস্বরূপঃ"
      },
      {
        "type": "code",
        "lang": "python",
        "code": "print(\"Hello World\")"
      },
      {
        "type": "text",
        "content": "আমি পাইথন ভাষায় প্রোগ্রাম লিখতে পছন্দ করি, তাই শুভেচ্ছা বার্তাও পাইথনে লিখলাম। আশা করি, ফ্রি সময়ে প্রযুক্তি বিষয়ক লেখালেখি আবার শুরু করতে পারবো। পাশাপাশি, অন্য ট্যাব গুলোর মতো টাইমলাইনেও সার্চ ফিচার ইমপ্লিমেন্ট করলাম। এর ফলে টাইমলাইনের পোস্টগুলো এখন খুব সহজেই খুঁজে পাওয়া যাবে।"
      }
    ]
  }
]